tap "aubreypwd/cask", "git@github.com:aubreypwd/homebrew-cask.git"
tap "dnicolson/bluetoothkeyboardenhancer"
tap "dteoh/sqa"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jhawthorn/fzy"
tap "rockymadden/rockymadden"
tap "sargsyan/github-notifier"
brew "antigen"
brew "aria2"
brew "automake"
brew "bchunk"
brew "bluetoothconnector"
brew "brew-pip"
brew "glib"
brew "pkg-config"
brew "unbound", restart_service: true
brew "gnutls"
brew "emacs", restart_service: true
brew "cask"
brew "ccat"
brew "cmake"
brew "composer"
brew "coreutils"
brew "curl"
brew "dialog"
brew "dmg2img"
brew "duti"
brew "gobject-introspection"
brew "harfbuzz"
brew "srt"
brew "ffmpeg"
brew "fzf"
brew "fzy"
brew "gh"
brew "ghq"
brew "libheif"
brew "python@3.8"
brew "imagemagick"
brew "gifify"
brew "git"
brew "git-lfs"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "gnupg"
brew "googler"
brew "jasper"
brew "graphicsmagick"
brew "grc"
brew "htop"
brew "hugo"
brew "jq"
brew "lynx"
brew "m-cli"
brew "mas"
brew "mdf2iso"
brew "micro"
brew "multitail"
brew "node"
brew "nativefier"
brew "node@10"
brew "node@12"
brew "node@14"
brew "nvm"
brew "pandoc"
brew "peco"
brew "percol"
brew "php@7.4", restart_service: true, link: true
brew "protobuf"
brew "protobuf-c"
brew "rsync"
brew "ruby"
brew "ruby-build"
brew "ssh-copy-id"
brew "sshfs"
brew "subversion"
brew "trash-cli"
brew "tree"
brew "unzip"
brew "vcsh"
brew "vim"
brew "watch"
brew "watchexec"
brew "wget"
brew "wp-cli"
brew "yara"
brew "yarn"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "hashicorp/tap/vault"
brew "rockymadden/rockymadden/slack-cli"
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "atext"
cask "basecamp"
cask "cakebrew"
cask "chillhop-radio"
cask "choosy"
cask "chromium"
cask "clean-me"
cask "copyclip"
cask "ditto"
cask "dropbox"
cask "dropshare"
cask "feedly"
cask "firefox"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "forklift"
cask "google-chrome"
cask "google-voice"
cask "harvest"
cask "helium"
cask "iina"
cask "insomnia"
cask "iterm2"
cask "itsycal"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "kindle"
cask "lastpass"
cask "libreoffice"
cask "licecap"
cask "macdown"
cask "macgdbp"
cask "meld"
cask "microsoft-edge-dev"
cask "microsoft-teams"
cask "muzzle"
cask "ndm"
cask "nordvpn"
cask "onlyoffice"
cask "onyx"
cask "quitter"
cask "rar"
cask "reedsy"
cask "riot"
cask "sequel-ace"
cask "sequel-pro"
cask "skype"
cask "slack"
cask "spectacle"
cask "spotify"
cask "stats"
cask "tableplus"
cask "tower"
cask "usage"
cask "virtualbox"
cask "zoomus"
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Bitdefender Virus Scanner", id: 500154009
mas "Bitwarden", id: 1352778147
mas "Color Maker", id: 561995913
mas "Context Menu", id: 1236813619
mas "Developer", id: 640199958
mas "Evernote", id: 406056744
mas "Friendly Streaming", id: 553245401
mas "GarageBand", id: 682658836
mas "GIF Keyboard", id: 1043270657
mas "Greenshot", id: 1103915944
mas "Harvest", id: 506189836
mas "Icon Maker Pro", id: 1405209362
mas "ImageOptim", id: 1450716465
mas "iMovie", id: 408981434
mas "Key Codes", id: 414568915
mas "Keynote", id: 409183694
mas "MenubarClock", id: 492167985
mas "Messenger", id: 1480068668
mas "Microsoft Excel", id: 462058435
mas "Microsoft To Do", id: 1274495053
mas "Milkshake", id: 1440379601
mas "New File Menu", id: 1064959555
mas "News Explorer", id: 1032670789
mas "Noto", id: 1095135886
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "PLIST Editor", id: 1157491961
mas "Poolside FM", id: 1514817810
mas "RSS Button for Safari", id: 1437501942
mas "Scrap Paper", id: 1448441317
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "Tincta", id: 448340648
mas "TinyNotepad", id: 1449415412
mas "ToothFairy", id: 1191449274
mas "Trello", id: 1278508951
