tap "browsh-org/browsh"
tap "cloudflare/cloudflare"
tap "dnicolson/bluetoothkeyboardenhancer"
tap "dteoh/sqa"
tap "github/gh"
tap "hashicorp/tap"
tap "henkrehorst/php"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "jhawthorn/fzy"
tap "lucapette/tap"
tap "nicoverbruggen/cask"
tap "rockymadden/rockymadden"
tap "sargsyan/github-notifier"
tap "shivammathur/php"
tap "sidneys/homebrew"
tap "stripe/stripe-cli"
tap "xvxx/code"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Graphical system information display for macOS
brew "archey"
# C library implementing the SSH2 protocol
brew "libssh2"
# Download with resuming and segmented downloading
brew "aria2"
# Core application library for C
brew "glib"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# GNOME accessibility toolkit
brew "atk"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Convert CD images from .bin/.cue to .iso/.cdr
brew "bchunk"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Install pip packages as homebrew formulae
brew "brew-pip"
# Extract files from Microsoft cabinet files
brew "cabextract"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Like cat but displays content with syntax highlighting
brew "ccat"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Color-highlighted diff(1) output
brew "colordiff"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# Utilities for converting macOS DMG images
brew "dmg2img"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Remote repository management made easy
brew "ghq"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Google Search and News from the command-line
brew "googler"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image processing tools collection
brew "graphicsmagick"
# Colorize logfiles and command output
brew "grc"
# Fulltext search engine and column store
brew "groonga"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# Tool for glamorous shell scripts
brew "gum"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# ID3 tag manipulation
brew "id3lib"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Modular IRC client
brew "irssi"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Text-based web browser
brew "lynx"
# Swiss Army Knife for macOS
brew "m-cli"
# System information fetcher, with an emphasis on performance and minimalism
brew "macchina"
# Web and API based SMTP testing tool
brew "mailhog"
# Tool to convert MDF (Alcohol 120% images) images to ISO images
brew "mdf2iso"
# Modern and intuitive terminal-based text editor
brew "micro"
# Terminal-based visual file manager
brew "midnight-commander"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# Pretty-print tabular data in Python
brew "python-tabulate"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Open source relational database management system
brew "mysql"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Simplistic interactive filtering tool
brew "peco"
# Interactive grep tool
brew "percol"
# Pretty system information tool written in POSIX sh
brew "pfetch"
# General-purpose scripting language
brew "php@8.0"
# General-purpose scripting language
brew "php@8.1"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Protocol buffers library
brew "protobuf-c"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Python version management
brew "pyenv"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Utility that provides fast incremental file transfer
brew "rsync"
# Install various Ruby versions and implementations
brew "ruby-build"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Version control system designed to be a better CVS
brew "subversion"
# Manipulate and query tags on macOS files
brew "tag"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Config manager based on git
brew "vcsh"
# Vi 'workalike' with many additional features
brew "vim"
# Terminal emulator widget used by GNOME terminal
brew "vte3"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Command-line interface for WordPress
brew "wp-cli"
# Malware identification and classification tool
brew "yara"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# The modern, text-based browser
brew "browsh-org/browsh/browsh"
# Cloudflare Tunnel
brew "cloudflare/cloudflare/cloudflared"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
brew "lucapette/tap/fakedata"
# General-purpose scripting language
brew "shivammathur/php/php@7.3"
# General-purpose scripting language
brew "shivammathur/php/php@7.4"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# quick lil gopher client
brew "xvxx/code/phetch"
# Command-line interface for 1Password
cask "1password-cli"
# Instant messaging application
cask "adium"
# Enable Windows-like alt-tab
cask "alt-tab"
# GUI app for Homebrew
cask "cakebrew"
# Open links in any browser
cask "choosy"
# System cleaner for logs, caches and more
cask "clean-me"
# Terminal emulator mimicking the old cathode display
cask "cool-retro-term"
# Command-line display management utility
cask "cscreen"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Utility to hide menu bar items
cask "hiddenbar"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Create apps from groups of websites
cask "multi"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Free and open-source SoundCloud client
cask "nuage"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
cask "phpmon"
# Archive manager for data compression and backups
cask "rar"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
# BBS terminal program
cask "syncterm"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Video communication and virtual meeting platform
cask "zoom"
vscode "alefragnani.Bookmarks"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "DEVSENSE.composer-php-vscode"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.vscode-pull-request-github"
vscode "ivanzusko.theme-chrome-devtools-dark"
vscode "johnbillion.vscode-wordpress-hooks"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-scss"
vscode "Phu1237.vs-browser"
vscode "streetsidesoftware.code-spell-checker"
vscode "timonwong.shellcheck"
vscode "valeryanm.vscode-phpsab"
vscode "Zignd.html-css-class-completion"
